In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [10]:
df = pd.read_csv("c:\\Users\\HP\\anaconda3\\home_prices.csv")

In [11]:
df

   area  bedroom  age   price
0  2600      3.0   20  550000
1  3000      4.0   15  562000
2  3200      NaN   18  610000
3  3600      3.0   30  680000
4  4000      5.0    8  725000

In [15]:
med = df.bedroom.median()
med

3.5

In [17]:
import math
median_bedrooms = math.floor(med)

In [18]:
median_bedrooms

3

In [21]:
df.bedroom = df.bedroom.fillna(median_bedrooms)

In [22]:
df.bedroom

0    3.0
1    4.0
2    3.0
3    3.0
4    5.0
Name: bedroom, dtype: float64

In [23]:
df

   area  bedroom  age   price
0  2600      3.0   20  550000
1  3000      4.0   15  562000
2  3200      3.0   18  610000
3  3600      3.0   30  680000
4  4000      5.0    8  725000